released/NUC1262BSP_LLSI_RGBLED/SampleCode/Template/project_config.h
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include "NuMicro.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/
extern volatile uint32_t BitFlag;


typedef enum{
	flag_start = 0 ,

	
	flag_error ,		
	flag_DEFAULT	
}Flag_Index;

/*_____ D E F I N I T I O N S ______________________________________________*/
#define _debug_log_UART_							(1)


#define LLSI_PORT								(LLSI3)
#define LLSI_PDMA_CH   							(4)
#define LLSI_PDMA_OPENED_CH   					(1 << LLSI_PDMA_CH)

/*
	EXAMPLE : 
	6 LED , each LED with 3 bytes (RGB) , total target 18 BYTES
	by using uin32_t arry output (4 bytes) , 18 / 4 = 4.5 , need send 4.5 x uint32_t = 5 x uint32_t

	24 LED , each LED with 3 bytes (RGB) , total target 24 X 3 BYTES
	by using uin32_t arry output (4 bytes) , 72 / 4 = 18 , need send 18 x uint32_t

	6 LEDs = 6 x 3 (RGB color) = 18 bytes , need to use 5 x uin32_t buffer ( 18 / 4 = 4.5)		
	8 LEDs = 8 x 3 (RGB color) = 24 bytes , need to use 6 x uin32_t buffer ( 24 / 4 = 6)
	24 LEDs = 24 x 3 (RGB color) = 72 bytes , need to use 18 x uin32_t buffer ( 72 / 4 = 18)	
	
*/

//debug purpose

/*
	if use ENABLE_DEBUG_WS2812_PROTOCOL , 
	need to set LED_NUM : 6 , LED_DATA_LEN : 5
*/
//#define ENABLE_DEBUG_WS2812_PROTOCOL

#if defined (ENABLE_DEBUG_WS2812_PROTOCOL)
//#define LED_NUM									(6)
//#define LED_DATA_LEN							(5)

#define LED_NUM									(24)
#define LED_DATA_LEN							(18)

#else	// custom
#define LED_NUM									(24)
#define LED_DATA_LEN							(18)
#endif

/*_____ M A C R O S ________________________________________________________*/

#define BitFlag_ON(flag)							(BitFlag|=flag)
#define BitFlag_OFF(flag)							(BitFlag&=~flag)
#define BitFlag_READ(flag)							((BitFlag&flag)?1:0)
#define ReadBit(bit)								(uint32_t)(1<<bit)

#define is_flag_set(idx)							(BitFlag_READ(ReadBit(idx)))
#define set_flag(idx,en)							( (en == 1) ? (BitFlag_ON(ReadBit(idx))) : (BitFlag_OFF(ReadBit(idx))))

//MACRO : Swap Integers Macro
#ifndef SWAP
#define SWAP(a, b)     							{(a) ^= (b); (b) ^= (a); (a) ^= (b);}
#endif

#ifndef MAX
#define MAX(a,b) 								(((a) > (b)) ? (a) : (b))
#endif

#ifndef MIN
#define MIN(a,b) 								(((a) < (b)) ? (a) : (b))
#endif

//16 --> 8 x 2
#ifndef HIBYTE
#define HIBYTE(v1)              					((uint8_t)((v1)>>8))                      		//v1 is uint16_t
#endif

#ifndef LOBYTE
#define LOBYTE(v1)              					((uint8_t)((v1)&0xFF))
#endif

//8 x 2 --> 16
#ifndef MAKEWORD
#define MAKEWORD(v1,v2)         				((((uint16_t)(v1))<<8)+(uint16_t)(v2))      //v1,v2 is uint8_t
#endif

//8 x 4 --> 32
#ifndef MAKELONG
#define MAKELONG(v1,v2,v3,v4)   					(uint32_t)((v1<<24)+(v2<<16)+(v3<<8)+v4)  //v1,v2,v3,v4 is uint8_t
#endif

#ifndef SIZEOF
#define SIZEOF(a) 								(sizeof(a) / sizeof(a[0]))
#endif

#ifndef ENDOF
#define ENDOF(a) 								((a) + SIZEOF(a))
#endif

#ifndef CLEAR
#define CLEAR(x) 								(memset(&(x), 0, sizeof (x)))
#endif	

#ifndef ABS
#define ABS(X)  									((X) > 0 ? (X) : -(X)) 
#endif

/*_____ F U N C T I O N S __________________________________________________*/
void reset_buffer(void *dest, unsigned int val, unsigned int size);
void copy_buffer(void *dest, void *src, unsigned int size);
void dump_buffer(uint32_t *pucBuff, int nBytes);
void  dump_buffer_hex(uint8_t *pucBuff, int nBytes);

void delay_ms(uint16_t ms);
void LLSI_PDMA_Transfer(uint32_t* LLSIDataBuffer, uint32_t len);


